Reading CSV and TXT Files

In [1]:
import pandas as pd

In [5]:
### Reading Data with Python
#### Exam text and btc sales csv
#### Opening csv using traditional Python way
with open('data/btc-market-price.csv', 'r') as fp:
    print(fp)

<_io.TextIOWrapper name='data/btc-market-price.csv' mode='r' encoding='cp1252'>

In [4]:
with open('data/btc-market-price.csv', 'r') as fp:
    for index, line in enumerate(fp.readlines()):
        if (index < 10):
            print(index, line)

0 2/4/17 0:00,1099.169125

1 3/4/17 0:00,1141.813

2 4/4/17 0:00,?

3 5/4/17 0:00,1133.079314

4 6/4/17 0:00,-

5 7/4/17 0:00,-

6 8/4/17 0:00,1181.149838

7 9/4/17 0:00,1208.8005

8 10/4/17 0:00,1207.744875

9 11/4/17 0:00,1226.617038

The csv module

In [6]:
### exam_review_csv which has > as delimiter instead of , or |
import csv
with open('data/exam_review.csv', 'r')as fp:
    reader = csv.reader(fp, delimiter='>') # special delimiter
    next(reader) # skipping header
    for index, values in enumerate(reader):
        if not values:
            continue
        fname, lname, age, math, french = values
        print(f"{fname} {lname} (age {age}) got {math} in Math and {french} in French")

Ray Morley (age 18) got 68,000 in Math and 75,000 in French
Melvin Scott (age 24) got 77 in Math and 83 in French
Amirah Haley (age 22) got 92 in Math and 67 in French
Gerard Mills (age 19) got 78,000 in Math and 72 in French
Amy Grimes (age 23) got 91 in Math and 81 in French

Reading data with Pandas

In [7]:
### read_csv method

df = pd.read_csv('data/btc-market-price.csv', header=None)

In [8]:
df.head()

             0            1
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00     1141.813
2  4/4/17 0:00            ?
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00            -

In [9]:
df = pd.read_csv('data/btc-market-price.csv', header=None, na_values=['', '?', '-'])

In [10]:
df.head()

             0            1
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00          NaN

Column names using names parameter

In [11]:
df = pd.read_csv('data/btc-market-price.csv', 
                 header=None, 
                 na_values=['', '?', '-'],
                 names=['Timestamp', 'Price'],
                 dtype={'Price':'float'}
                 )

In [12]:
df.dtypes

Timestamp     object
Price        float64
dtype: object

Date parser using parse_dates parameter

In [13]:
df = pd.read_csv('data/btc-market-price.csv', 
                 header=None, 
                 na_values=['', '?', '-'],
                 names=['Timestamp', 'Price'],
                 dtype={'Price':'float'},
                 parse_dates = [0]
                 )

C:\Users\naren\AppData\Local\Temp\ipykernel_31436\109379402.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df = pd.read_csv('data/btc-market-price.csv',

In [14]:
df.head()

   Timestamp        Price
0 2017-02-04  1099.169125
1 2017-03-04  1141.813000
2 2017-04-04          NaN
3 2017-05-04  1133.079314
4 2017-06-04          NaN

In [15]:
df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

Using Exam review csv

In [16]:
pd.read_csv('data/exam_review.csv', sep='>',thousands=',')

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18       68000         75000
1     Melvin     Scott   24          77            83
2     Amirah     Haley   22          92            67
3     Gerard     Mills   19       78000            72
4        Amy    Grimes   23          91            81

Skipping rows

In [17]:
pd.read_csv('data/exam_review.csv', sep='>',skiprows=2)

   Melvin   Scott  24      77  83
0  Amirah   Haley  22      92  67
1  Gerard   Mills  19  78,000  72
2     Amy  Grimes  23      91  81

Get rid of blank lines

In [18]:
pd.read_csv('data/exam_review.csv', sep='>',skip_blank_lines=False)

  first_name last_name   age math_score french_score
0        Ray    Morley  18.0     68,000       75,000
1     Melvin     Scott  24.0         77           83
2     Amirah     Haley  22.0         92           67
3        NaN       NaN   NaN        NaN          NaN
4     Gerard     Mills  19.0     78,000           72
5        Amy    Grimes  23.0         91           81

Save to CSV File

In [20]:
df

     Timestamp        Price
0   2017-02-04  1099.169125
1   2017-03-04  1141.813000
2   2017-04-04          NaN
3   2017-05-04  1133.079314
4   2017-06-04          NaN
..         ...          ...
360 2018-03-28  7960.380000
361 2018-03-29  7172.280000
362 2018-03-30  6882.531667
363 2018-03-31  6935.480000
364 2018-01-04  6794.105000

[365 rows x 2 columns]

In [22]:
df.to_csv('data/out.csv')